       01 DFHAID-KEYS.
          05 DFHENTER     PIC X VALUE X'7D'.
          05 DFHPF1       PIC X VALUE X'F1'.
          05 DFHPF2       PIC X VALUE X'F2'.
          05 DFHPF3       PIC X VALUE X'F3'.
          05 DFHCLEAR     PIC X VALUE X'6D'.
          05 DFHPA1       PIC X VALUE X'6C'.

