       01  CH-COMMAREA.
           03  CH-COMUN.
               05  CH-TRANSACCION          PIC X(4).
               05  CH-TERMINAL             PIC X(4).
               05  CH-TRANS-RETORNO        PIC X(4).
               05  CH-PROGRAMA-RETORNO     PIC X(8).
               05  CH-LINK                 PIC X(8).
               05  CH-START                PIC X(4).
               05  CH-XCTL                 PIC X(8).
