DSN    SYSTEM       (DB9G)
BIND   PLAN         (DEPOPL)     -
       PKLIST       (APPCOLL.*)  -
       ACTION       (REPLACE)    -
       ISOLATION    (CS)         -
       VALIDATE     (BIND)       -
       ENCODING     (EBCDIC)     -
       FLAG         (I)          -
       RELEASE      (COMMIT)
END
